app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
  def index
    @movies = Movie.all

INSERT INTO "movies" ("name", "director_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Jurassic Park"], ["director_id", 2], ["created_at", "2016-07-17 13:32:46.322177"], ["updated_at", "2016-07-17 13:32:46.322177"]]
---
  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save

UPDATE "movies" SET "director_id" = ?, "category_id" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["director_id", 2], ["category_id", 2], ["updated_at", "2016-07-17 14:31:11.177162"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @movie.update(movie_params)

SELECT  "directors".* FROM "directors"  ORDER BY "directors"."id" ASC LIMIT 1
---
    def set_directors
      @directors = Director.all.collect{|director|[director.name, director.id]}

SELECT "categories".* FROM "categories"
---
    def set_category
      @categories = Category.all.collect{|category|[category.name, category.id]}

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_movie
      @movie = Movie.find(params[:id])